package com.example.homeservise.Data;

import android.content.Context;

import androidx.annotation.NonNull;
import androidx.room.Database;
import androidx.room.Room;
import androidx.room.RoomDatabase;
import androidx.sqlite.db.SupportSQLiteDatabase;

import com.example.homeservise.Data.Category.Category;
import com.example.homeservise.Data.Category.CategoryDao;
import com.example.homeservise.Data.Order.Orders;
import com.example.homeservise.Data.Order.OrdersDao;
import com.example.homeservise.Data.Service.Services;
import com.example.homeservise.Data.Service.ServicesDao;
import com.example.homeservise.Data.User.UserDao;
import com.example.homeservise.Data.User.UserData;
import com.example.homeservise.R;

import java.util.concurrent.ExecutorService;
import java.util.concurrent.Executors;
//TODO زود الجدول هنا
@Database(entities = {Category.class, Services.class, UserData.class, Orders.class},version = 1)
public abstract class RoomDatabases extends RoomDatabase {
    private static volatile RoomDatabases instance;

    //TODO اعمل باقي الجداول هنا
    public abstract ServicesDao servicesDao();
    public abstract CategoryDao categoryDao();
    public abstract UserDao userDao();
    public abstract OrdersDao ordersDao();



    private static final int NUMBER_OF_THREADS = 4;
    static final ExecutorService databaseWriteExecutor =
            Executors.newFixedThreadPool(NUMBER_OF_THREADS);


    static RoomDatabases getDatabase(final Context context) {
        if (instance == null) {
            synchronized (RoomDatabases.class) {
                if (instance == null) {
                    instance = Room.databaseBuilder(context.getApplicationContext(),
                                    RoomDatabases.class, "Room_Databases")
                            .addCallback(sRoomDatabaseCallback)
                            .build();
                }
            }
        }
        return instance;
    }
    private static final RoomDatabase.Callback sRoomDatabaseCallback = new RoomDatabase.Callback() {
        @Override
        public void onCreate(@NonNull SupportSQLiteDatabase db) {
            super.onCreate(db);

            databaseWriteExecutor.execute(() -> {
//                // Populate the database in the background.
//                // If you want to start with more words, just add them.
                //Todo ////////////////////////////
                CategoryDao categoryDao = instance.categoryDao();
                categoryDao.deleteAllCategory();
                Category category = new Category("نظافة", R.drawable.broom);
                categoryDao.insert(category);
                Category category1 = new Category("ميكانيكا", R.drawable.mechanic);
                categoryDao.insert(category1);
                Category category2 = new Category("سباكة", R.drawable.plumber);
                categoryDao.insert(category2);
                Category category3 = new Category("كهرباء", R.drawable.electrician);
                categoryDao.insert(category3);
                Category category4 = new Category("غسيل", R.drawable.washing);
                categoryDao.insert(category4);
                Category category5 = new Category("نجارة", R.drawable.carpenter);
                categoryDao.insert(category5);
                Category category6 = new Category("حدائق", R.drawable.gardener);
                categoryDao.insert(category6);
                Category category7 = new Category("طباخ", R.drawable.cooker);
                categoryDao.insert(category7);
                Category category8 = new Category("تعقيم", R.drawable.disinfection);
                categoryDao.insert(category8);
                Category category9 = new Category("بيبي سيتر", R.drawable.babysitter);
                categoryDao.insert(category9);
                //todo////////////////////////////////////////////////////////
                ServicesDao servicesDao = instance.servicesDao();
                servicesDao.deleteAllservices();
                Services services=new Services(R.drawable.electrician,"اعمال الكهرباء ","40 جنية للمعاينة",40,"كهرباء",0,1,0,"جميع اعمال صيانة الكهرباء والتركيبات يقدمها افضل الفنيين المحترفين اصحاب الخبرة .\n * نقدم اعمال الصيانة للمنازل والشركات \n* اعمال التأسيس للشقق والفيلات والعمارات \nملاحظات: \n*يتم الاتفاق على السعر بعد اتمام المعاينة \n*يتم حجز العمال الاقرب من المنطقة الاقرب اليك\n*يمكن للعميل شراء الخامات او يقوم الفني بشرائها ومحاسبة العميل عليها \n*السعر غير شامل الخامات  " );
                servicesDao.insert(services);
                Services services1=new Services(R.drawable.plumber,"تأسيس سباكة 1 حمام+1 مطبخ ","2000 جنيه",2000,"سباكة",0,0,0,"TODO");
                servicesDao.insert(services1);
                Services services2=new Services(R.drawable.carpenter,"نجارة واعمال خشبية ","40 جنية للمعاينة",40,"نجارة",0,0,0,"TODO");
                servicesDao.insert(services2);
                Services services3=new Services(R.drawable.broom,"تنظيف الواجهات من الخارج","0 على حسب المعاينه ",0,"نظافة",1,0,0,"TODO");
                servicesDao.insert(services3);
                Services services4=new Services(R.drawable.broom,"تنظيف ما بعد التشطيب","14 جنية للمتر",14,"نظافة",0,0,0,"TODO");
                servicesDao.insert(services4);
                Services services5=new Services(R.drawable.broom,"تنظيف خزانات ","40 جنية للمعاينة",40,"نظافة",1,0,0,"TODO");
                servicesDao.insert(services5);
                Services services6=new Services(R.drawable.broom,"تعقيم وتطهير ضد فيروس كورونا 19","625 جنية",625,"نظافة",0,0,1,"TODO");
                servicesDao.insert(services6);
                Services services7=new Services(R.drawable.broom,"نظافة منزلية مميزة Premium","520 جنية",520,"نظافة",1,0,1,"TODO");
                servicesDao.insert(services7);
                Services services8=new Services(R.drawable.broom,"اعمال الحدائق واللاندسكيب","40 جنية للمعاينة",40,"حدائق",0,0,0,"نقدم لكم أعمال الحدائق واللاندسكيب من إنشاء وتصميم وصيانة الحدائق والفيلات\n" + "\n" + "والشركات، توريد النباتات الداخلية والخارجية\n" + "\n" + "للفيلات والشركات والقرى السياحية\n" + "\n" + "إعادة ترميم وصيانة الحدائق التالفة وتطويرها واضافة نباتات جديدة جميع انواع المشايات ) نباتيه, صخريه,\n" + "\n" + "زلطيه )\n" + "\n" + "جميع انواع البرجولات ( مغطاه كساء حلفا جميع اعمال البامبو والتمر حنه والحصير\n" + "\n" + "سمار, تمر حنه )\n" + "\n" + "مشايات وجبال بأفضل أنواع النجيله\n" + "\n" + "الطبيعيه\n" + "\n" + ".\n" + "\n" + "تصميم وتنسيق وإنشاء الحدائق المميزة غرف خشبيه ( اكواخ ) تصمیمات مختلفه كنب ) خشبى, حجرى ) هشمه و موزايكو\n" + "\n" + "بارات ودفايات وشوايات ( داخليه وخارجيه )\n" + "\n" + "الشلالات والصخر الصناعى\n" + "\n" + ". أعمال الهشمه والحجر المنحوت\n" + "\n" + "أعمال المايكا والبازلت\n" + "\n" + "رخام عشوائی ورسومات زلط\n" + "\n" + "توريد كافه المستلزمات الكهربيه للحديقه توريد كافة المستلزمات الزراعة . توريد وتنسيق نباتات الظل الداخلية\n" + "\n" + "بالتعاقد مع افضل الشركات المتميزة في أعمال اللاندسكيب ، اطلب معاينة الآن لمعرفة التكلفة\n" + "\n" + "قبل البدء\n" + "\n" + "تكلفة المعاينة 40 جنيه");
                servicesDao.insert(services8);
                Services services9=new Services(R.drawable.broom,"تنظيف المنزل للمره الواحدة حتى 170 م","250 جنيه",250,"نظافة",0,0,0,"خدمة النظافة المنزلية المعتادة التى تحافظ على منزلك نظيفا طوال الوقت ، مقدمة من مجموعة من العمال والعاملات المتعاقد معهم وتدريبهم لضمان الجودة والأمانة وتقديم خدمة نظافة مضمونة تتم بإحترافية ، نظافة الشقق و الفيلات والمكاتب\n" + "\n" + "\n" + "الخدمة تشمل:\n" + "تنظيف 7 وحدات (3 غرف + قطعتين ريسبشن + حمام مع حمام ضيوف مجانا + مطبخ) حتى 170 متر\n" + " \n" + "\n" + "الريسبشن وغرف المعيشة: \n" + "- كنس ومسح كل الأرضيات\n" + "- كنس وتنفيض السجاد ومسح أسفله\n" + "- تزعيف الحوائط والسقف\n" + "- تلميع جميع الطاولات والأسطح وتلميع الأنتيكات\n" + "- تلميع الأثاث من الخارج\n" + "- تنظيف الشبابيك والزجاج من الأتربة  من الداخل والخارج في متناول اليد. (حتي لا يتعرض العامل لخطورة السقوط )\n" + "- كنس وتنظيف اسفل الاثاث\n" + "-البلكونات \n" + "- فى حالة زيادة غرفة زيادة  يضاف 20 جنيه، حتى 170 متر للعاملة الواحدة\n" + "\n" + "\n" + "غرف النوم: \n" + "- كنس ومسح وتنظيف الأرضيات\n" + "- كنس وتنفيض السجاد والمسح اسفله\n" + "- تزعيف الحوائط والسقف\n" + "- تلميع الأثاث من الخارج\n" + "- تغيير فرش السراير\n" + "- تنظيف ومسح البلكونات والشبابيك\n" + "- تنظيف المرايات وترتيب الغرفة\n" + "-البلكونات \n" + "\n" + "الحمامات:\n" + "- غسيل ومسح الأرضيات\n" + "- غسيل المراحيض\n" + "- غسيل الأحواض\n" + "- غسيل وتنظيف البانيو\n" + "- تنظيف المرايات وجمع وتفريغ القمامة\n" + "- يضاف حمام ضيوف واحد مجاناً داخل التكلفة\n" + "- غسيل الحوائط حتى متناول اليد\n" + " \n" + "المطبخ:\n" + "- مسح وتنظيف الأرضيات\n" + "- تنظيف جميع الاسطح والرخام\n" + "- غسيل ومسح البوتجاز من الخارج\n" + "- تنظيف وغسيل الأحواض\n" +"- تنظيف الثلاجة من الداخل والخارج ويجب تفريغ محتويات الثلاجة وإعادتها بواسطة العميل حفاظا على النظافة العامة.\n" + "- غسيل الاطباق بحد اقصى مقدار وجبتين (ماعدا حالات العزومات والحفلات تكون بتكلفة اضافية)\n" + "- تنظيف الشفاطات بدون استخدام مواد كاوية (لعدم تعرض العامل للخطورة)\n" + "- تنظيف درف المطبخ من الخارج فقط\n" + "- تنظيف الميكرويف من الخارج\n" + "- جمع وتفريغ القمامة\n" + "- غسيل الحوائط حتى متناول اليد\n" + "\n" + "لا يشمل العرض:\n" + "× غسيل السجاد والمفروشات والستائر بالمنظفات. (راجع عرض نظافة المفروشات المنفصل)\n" + "× غسيل الحوائط بالكامل (تكلفة اضافية)\n" + "× غسيل النجف (تكلفة اضافية)\n" + "× تنزيل كل محتويات المطبخ وتنظيف الدرف و إعادة رص محتويات المطبخ (تكلفة اضافية)\n" + "× تنزيل كل محتويات النيش و تلميعه من الداخل و إعادة رص محتوياته.\n" + "× جمع او ترتيب الملابس ، او نشرها ، او كوى الملابس\n" + "× تنظيف اثار الدهانات، التشطيبات، الأسمنت او ما شابه ذلك\n" + "\n" + "من يحضر ادوات التنظيف المستخدمة ؟\n" + "يقوم العميل بتوفير جميع الادوات المناسبة حسب رغبة العميل\n" + "\n" + "متى يبدأ وينتهى وقت التنظيف ؟\n" + "من الساعة  9 ص حتى تنتهى من الخدمة بحد اقصى الساعة 5 م ، ويمكن ترتيب ميعاد مختلف مع خدمة العملاء حسب المتاح\n" + "\n" + "ماهى مناطق التغطية و تكلفة الانتقالات؟\n" + "تضاف تكلفة الانتقالات  35 جنيه داخل القاهرة للعامل الواحد\n" + "50 جنيه فى لمناطق (أكتوبر - الشيخ زايد - حدائق الأهرام - التجمعات - الرحاب - مدينتي - الشروق ) للعامل الواحد\n" + "نغطى القاهرة الكبرى\n" + "\n" + "هل يمكن أن الغى طلبى فى اى وقت؟\n" + "نعم يمكن الغاء الطلب او تعديله فى اى وقت وبدون اى تكلفة\n" + "\n" + "هل يرتدى العامل الكمامة؟\n" + "نعم يرتدى الكمامة ويمكن التأكيد على هذا الطلب عند الحجز\n" + "\n" + "من يقوم بالتنظيف وهل متوفر سيدات ورجال وهل يمكن طلب اكتر من عامل؟\n" + "تتم النظافة بعامل واحد ، ويمكن طلب اكثر من عامل ويزيد ضعف التكلفة ، و متوفر سيدات ورجال حسب توافر العمالة المطلوبة.\n" + "\n" + "كيف اعرف العامل الخاص بطلبى ، وهل العمال مضمونين ؟\n" + "يتم مقابلة وتحديد مستوى جميع العمال والتعاقد مع المناسبين وتدريبهم لضمان الجودة والأمانة ، وجميع بيناتهم والبطاقات الشخصية موجودة ويمكن طلب صورة البطاقة ومشاهدة تفاصيل العامل من خلال التطبيق بعد حجز الاوردر والتواصل معه.\n" + "\n" + "هل يوجد خدمات اضافية؟\n" + "نعم يوجد ( تنظيف نجف - غسيل حوائط الحمام والمطبخ بالكامل - مواعين عزومات) ، بزيادة 50ج للبند الواحد\n" + "\n" + "هل يوجد اى تكاليف اخرى زيادة ، وماذا افعل فى حالة طلب العاملة تكلفة زيادة؟\n" + "يتم فقط دفع التكلفة الموضحة والمتفق عليها مع خدمة العملاء وبدون اى زيادة.\n" + "\n" + "يوجد باقات اخرى للمساحات الاكبر");
                servicesDao.insert(services9);
                Services services10 =new Services(R.drawable.carpenter,"نجارة وأعمال خشبية","40 جنية للمعاينة",40,"نجارة",0,0,0,"أعمال النجارة والأعمال الخشبية للأثاث المنزلي  ،  بالتعاقد مع مجموعة من افضل النجارين المحترفين اصحاب الخبرة فى القاهرة الكبرى .\n" + "• صيانة أبواب وشبابيك\n" + "• تصليح المكاتب\n" + "• تصميم قطع اثاث خشبى\n" + "• تصنيع دواليب ..الخ\n" + "ملاحظات:\n" + "* يتم الاتفاق علي السعر بعد إتمام المعاينة \n" + "\n" + "* يتم حجز العمال الأقرب من منطقة الخدمة \n" + "\n" + "* يمكن للعميل شراء الخامات او يقوم الفني بشرائها ويتم محاسبة العميل عليها \n" + "\n" + "* يتم تحديد الميعاد حسب الاتفاق مع الفني \n" + "\n" + "* السعر غير شامل الخامات \n" + "\n" + "التكلفة:\n" + "- يقوم الفنى بالمعاينة لتحديد عملية وتكلفة الصيانة فقط بـ 40 جنيه ويبلغك بالتكلفة والخامات قبل البدء\n" + "- تكلفة المعاينة تخصم من التكلفة الاجمالية فى حالة تنفيذ الخدمة.\n" + "- فى حالة تنفيذ الخدمة فى نفس يوم المعاينة ، لا يتم تحصيل معاينة ويتم دفع تكلفة الخدمة المتفق عليها.\n" + "- ويمكنك إجراء معاينة مجانية عن طريق إرفاق صور مع طلبك من خلال تطبيق تاسكتى او عن طريق الواتس أب بدلا من زيارة الفنى.\n" + "\n" + " كيف أضمن الفنيين والأمانة؟\n" + "جميع الفنيين و الشركات المتعاقدين مع تاسكتي بياناتهم مسجلة بالكامل و موقع معهم عقود رسمية تضمن حقوق العملاء. ولكن يرجي العلم أنه في حالة التعامل مباشرة مع الفني بدون علم الشركة فأن الشركة تصبح غير مسؤله عن أي مشكلة تحدث وغير ملزمة بالتدخل او تقديم اي بيانات عن الفني في هذه الحالة.");
                servicesDao.insert(services10);
                Services services11 =new Services(R.drawable.plumber,"خدمات السباكة والتركيبات الصحية","40 جنية للمعاينة",40,"سباكة",0,0,0,"جميع أعمال السباكة والتركيبات الصيحة يقدمها  مجموعة من افضل الفنيين المحترفين اصحاب الخبرة. نغطي القاهرة الكبري بالكامل!\n" + "• نقدم أعمال الصيانات للمنازل والشركات\n" + "• أعمال التأسيس للشقق والفيلات والعمارات\n" + "تاسكتى بتوفر سباكين محترفين فى كل المجالات ، الصيانات والاصلاحات وأعمال التأسيس\n" + "بالتعاقد مع مجموعة من السباكين المضمونين ، شغلك فى أمان ومتابعة دورية من خدمة العملاء لحد ما الخدمة تتم\n" + "ملاحظات:\n" + "\n" + "يتم الاتفاق علي السعر بعد إتمام المعاينة \n" + "\n" + "يتم حجز العمال الأقرب من منطقة الخدمة \n" + "\n" + "يمكن للعميل شراء الخامات او يقوم الفني بشرائها ويتم محاسبة العميل عليها \n" + "\n" + "يتم تحديد الميعاد حسب الاتفاق مع الفني\n" + "\n" + "التكلفة:\n" + "- يقوم الفنى بالمعاينة لتحديد عملية وتكلفة الصيانة فقط بـ 40 جنيه ويبلغك بالتكلفة والخامات قبل البدء\n" + "- تكلفة المعاينة تخصم من التكلفة الاجمالية فى حالة تنفيذ الخدمة.\n" + "- فى حالة تنفيذ الخدمة فى نفس يوم المعاينة ، لا يتم تحصيل معاينة ويتم دفع تكلفة الخدمة المتفق عليها.\n" + "- ويمكنك إجراء معاينة مجانية عن طريق إرفاق صور مع طلبك من خلال تطبيق تاسكتى او عن طريق الواتس أب بدلا من زيارة الفنى.");
                servicesDao.insert(services11);
                Services services12 =new Services(R.drawable.broom,"نظافة منزلية شاملة","365 جنية",365,"نظافة",0,0,0,"خدمة النظافة المنزلية العميقة التى تحافظ على منزلك نظيفا طوال الوقت، مقدمة من مجموعة من العمال والعاملات المتعاقد معهم وتدريبهم لضمان الجودة والأمانة وتقديم خدمة نظافة مضمونة تتم بإحترافية ، نظافة الشقق و الفيلات والمكاتب\n" + "\n" + "الخدمة تشمل:\n" + "تنظيف 7 وحدات (3 غرف + قطعتين ريسبشن + حمام مع حمام ضيوف مجانا + مطبخ) حتى 150 متر \n" + "\n" + "الريسبشن وغرف المعيشة: \n" + "- كنس ومسح كل الأرضيات\n" + "- كنس وتنفيض السجاد ومسح أسفله\n" + "- تزعيف الحوائط والسقف\n" + "- تلميع جميع الطاولات والأسطح وتلميع الأنتيكات\n" + "- تلميع الأثاث من الخارج\n" + "- تنظيف الشبابيك والزجاج من الأتربة من الداخل والخارج في متناول اليد. (حتي لا يتعرض العامل لخطورة السقوط )\n" + "- كنس وتنظيف اسفل الاثاث\n" +"- غسيل النجف \n" + " - تنظيف البلكونات \n" + "\n" + "- فى حالة زيادة غرفة زيادة يضاف 50 جنيه. \n" + "\n" + "غرف النوم: \n" + "- كنس ومسح وتنظيف الأرضيات\n" + "- كنس وتنفيض السجاد والمسح اسفله\n" + "- تزعيف الحوائط والسقف\n" + "- تلميع الأثاث من الخارج\n" + "- تغيير فرش السراير\n" + "- تنظيف ومسح البلكونات والشبابيك\n" + "- تنظيف المرايات وترتيب الغرفة\n" + "- تنظيف فوق الدواليب\n" + "\n" + "الحمامات:\n" + "- غسيل ومسح الأرضيات\n" + "- غسيل المراحيض\n" + "- غسيل الأحواض\n" + "- غسيل وتنظيف البانيو\n" + "- تنظيف المرايات وجمع وتفريغ القمامة\n" + "- يضاف حمام ضيوف واحد مجاناً داخل التكلفة\n" + "- غسيل الحوائط بالكامل\n" + "\n" + "المطبخ:\n" + "- مسح وتنظيف الأرضيات\n" + "- تنظيف جميع الاسطح والرخام\n" + "- غسيل ومسح البوتجاز من الخارج\n" + "- تنظيف وغسيل الأحواض\n" + "- تنظيف الثلاجة من الداخل والخارج ويجب تفريغ محتويات الثلاجة وإعادتها بواسطة العميل حفاظا على النظافة العامة.\n" + "- غسيل الاطباق بحد اقصى مقدار وجبتين (ماعدا حالات العزومات والحفلات تكون بتكلفة اضافية)\n" + "- تنظيف الشفاطات بدون استخدام مواد كاوية (لعدم تعرض العامل للخطورة)\n" + "- تنظيف درف المطبخ من الداخل و الخارج ( يتم تفريغ المحتويات وإعادتها بواسطة العميل حفاظا على النظافة العامة )\n" + "- تنظيف الميكرويف من الخارج\n" + "- جمع وتفريغ القمامة\n" + "- غسيل الحوائط بالكامل \n" + "\n" + "لا يشمل العرض: \n" + "× غسيل السجاد والمفروشات والستائر بالمنظفات. (راجع عرض نظافة المفروشات المنفصل)\n" + "× غسيل حوائط الشقة بالكامل \n" + "× تنزيل كل محتويات النيش و تلميعه من الداخل و إعادة رص محتوياته.\n" + "× جمع او ترتيب الملابس ، او نشرها ، او كوى الملابس\n" + "\n" + "\n" + "ما الفرق بين خدمة النظافة العادية و النظافة الشاملة ؟ \n" + "تتميز النظافة الشاملة انه يتم غسيل حوائط المطبخ و الحمام بالكامل و تشمل تنظيف تنظيف دواليب المطبخ من الداخل و الخارج، غسيل النجف و تنظيف فوق الدواليب ، بعكس النظافة العادية لا تشتمل على هذه الاضافات\n" + "\n" + "من يحضر ادوات التنظيف المستخدمة ؟\n" + "يقوم العميل بتوفير جميع الادوات المناسبة حسب رغبة العميل\n" + "\n" + "متى يبدأ وينتهى وقت التنظيف ؟\n" + "من الساعة  9 ص حتى تنتهى من الخدمة بحد اقصى الساعة 5 م ، ويمكن ترتيب ميعاد مختلف مع خدمة العملاء حسب المتاح\n" + "\n" + "ماهى مناطق التغطية و تكلفة الانتقالات؟ \n" + "التكلفة تشمل مصاريف الانتقالات لجميع المناطق في حالة العامل الواحد حتي مساحة 150 متر في حدود 7 قطع\n" + "ما عدا مناطق ( العبور - الرحاب - مدينتي - الشروق ) تكون تكلفة النظافة الشاملة 395 جنيه للعامل الواحد\n" + "نغطى القاهرة الكبرى\n" + "\n" + "هل يمكن أن الغى طلبى فى اى وقت؟\n" + "نعم يمكن الغاء الطلب او تعديله فى اى وقت وبدون اى تكلفة\n" + "\n" + "هل يرتدى العامل الكمامة؟\n" + "نعم يرتدى الكمامة ويمكن التأكيد على هذا الطلب عند الحجز\n" + "\n" + "من يقوم بالتنظيف وهل متوفر سيدات ورجال وهل يمكن طلب اكتر من عامل؟\n" + "تتم النظافة بعامل واحد ، ويمكن طلب اكثر من عامل ويزيد ضعف التكلفة ، و متوفر سيدات ورجال حسب توافر العمالة المطلوبة.\n" + "\n" + "كيف اعرف العامل الخاص بطلبى ، وهل العمال مضمونين ؟\n" + "يتم مقابلة وتحديد مستوى جميع العمال والتعاقد مع المناسبين وتدريبهم لضمان الجودة والأمانة ، وجميع بيناتهم والبطاقات الشخصية موجودة ويمكن طلب صورة البطاقة ومشاهدة تفاصيل العامل من خلال التطبيق بعد حجز الاوردر والتواصل معه.\n" + "\n" + "هل يوجد خدمات اضافية؟ \n" + "نعم متاح تنظيف مواعين عزومات بتكلفة اضافية 50 جنيه\n" + "\n" + "هل يوجد اى تكاليف اخرى زيادة، وماذا افعل فى حالة طلب العاملة تكلفة زيادة؟ \n" + "يتم فقط دفع التكلفة الموضحة والمتفق عليها مع خدمة العملاء وبدون اى زيادة.\n" + "\n" + " المساحات الأكبر من 150 متر:\n" + "يتم التنظيف بواسطة عاملين وتكون التكلفة 580 جنيه + مصاريف الانتقالات حتي مساحة 300 متر.\n" + " مصاريف الانتقالات في حالة ٢ عالمات: 70 جنيه للعاملين معا داخل القاهرة ، او 100 جنيه للعاملين معا فى المناطق (أكتوبر - الشيخ زايد - حدائق الأهرام - التجمعات - الرحاب - مدينتي - الشروق)");
                servicesDao.insert(services12);
                Services services13=new Services(R.drawable.plumber,"تأسيس سباكة 1 حمام + 1 بانيو + 1 مطبخ ","2700 جنيه",2700,"سباكة",0,0,0,"تأسيس 1 حمام + 1 بانيو + 1 مطبخ  (صرف وتغذية) ، ويشمل الآتى:\n" + "الحمام :\n" + " - تأسيس حوض الوجه\n" + "  - تأسيس خلاط الدش\n" + "  - تأسيس الكومبينيشن\n" + "  - صرف حوض الوجه \n" + "  - صرف بانيو  \n" + "  - بلاعة الصرف (البيبة )\n" + "المطبخ:\n" + "- تأسيس حوض المطبخ \n" + "- تأسيس فلتر \n" + "-  صرف حوض المطبخ \n" + "العرض لا يشمل:\n" + "- الخامات\n" + "- عملية التأسيس تتم من داخل الشقة فقط بدون استخدام حبل من خارج الشقة\n" + "- بدون عزل ارضية \n" + "- بدون تشطيب\n" + "ملاحظة:\n" + "* ان يكون الحمام او المطبخ على الطوب\n" + "* يتم الاتفاق علي السعر بعد إتمام المعاينة \n" + "* يتم حجز العمال الأقرب من منطقة الخدمة \n" + "* يمكن للعميل شراء الخامات او يقوم الفني بشرائها ويتم محاسبة العميل عليها \n" + "* تم تحديد الميعاد حسب الاتفاق مع الفني\n" + "*فى حالات المعاينة فقط تكون مصروفات المعاينة 25 جنيه فى جميع المناطق");
                servicesDao.insert(services13);
                Services services14=new Services(R.drawable.plumber,"تأسيس سباكة 2 حمام + 1 مطبخ","2900 جنيه",2900,"سباكة",0,0,0,"أسيس 2 حمام + 1 مطبخ  (صرف وتغذية) ، ويشمل الآتى:\n" + "حمام كبير:\n" + "- تأسيس حوض الوجه     \n" + "- تأسيس خلاط دش \n" + "- تأسيس كومبينيشن \n" + "- صرف حوض الوجه     \n" + "- بلاعة الصرف (البيبة )\n" + "حمام صغير:\n" + "- تأسيس حوض الوجه     \n" + "- تأسيس كومبينيشن \n" + "- صرف حوض الوجه     \n" + "- بلاعة الصرف (البيبة )\n" + "مطبخ :\n" + "- تأسيس حوض مطبخ \n" + "- تأسيس فلتر   \n" + "- صرف حوض مطبخ \n" + "العرض لا يشمل:\n" + "-  الخامات\n" + "- عملية التأسيس تتم من داخل الشقة فقط بدون استخدام حبل من خارج الشقة\n" + "- بدون عزل ارضية\n" + "- بدون تشطيب\n" + "ملاحظة:\n" + "ان يكون الحمام او المطبخ على الطوب\n" + "\n" + "-يتم الاتفاق علي السعر بعد إتمام المعاينة \n" + "-يتم حجز العمال الأقرب من منطقة الخدمة \n" + "-يمكن للعميل شراء الخامات او يقوم الفني بشرائها ويتم محاسبة العميل عليها \n" + "-يتم تحديد الميعاد حسب الاتفاق مع الفني\n" + "- فى حالات المعاينة فقط تكون مصروفات المعاينة 25 جنيه فى جميع المناطق\n" + " * نغطى القاهرة الكبرى بالكامل.");
                servicesDao.insert(services14);
                Services services15=new Services(R.drawable.plumber,"تأسيس سباكة 2 حمام + 1 بانيو + 1 مطبخ ","3650 جنيه",3650,"سباكة",0,0,0,"تأسيس 2 حمام(كبير وصغير) + 1 بانيو + 1 مطبخ  (صرف وتغذية) ، ويشمل الآتى:\n" + "حمام كبير:\n" + "- بانيو \n" + "- تأسيس حوض الوجه   \n" + "- تأسيس خلاط الوجه   \n" + "- تأسيس كومبينيشن \n" + "- صرف حوض الوجه   \n" + "- صرف بانيو \n" + "- بلاعة الصرف (البيبة )\n" + "حمام صغير:\n" + "- تأسيس حوض الوجه   \n" + "- تأسيس كومبينيشن \n" + "- صرف حوش الوجه   \n" + " - بلاعة الصرف (البيبة )\n" + "مطبخ:\n" + "- تأسيس حوض مطبخ \n" + "- تأسيس فلتر \n" + "- صرف حوض مطبخ \n" + "العرض لا يشمل:\n" + " \n" + "\n" + "x الخامات \n" + "xعملية التأسيس تتم من داخل الشقة فقط بدون استخدام حبل من خارج الشقة \n" + "xبدون عزل أرضية \n" + "xبدون تشطيب \n" + "ملاحظة:\n" + "أن يكون الحمام او المطبخ على الطوب\n" + "\n" + "يتم الاتفاق علي السعر بعد إتمام المعاينة \n" + "يتم حجز العمال الأقرب من منطقة الخدمة \n" + "يمكن للعميل شراء الخامات أو يقوم الفني بشرائها ويتم محاسبة العميل عليها \n" + "يتم تحديد الميعاد حسب الاتفاق مع الفني\n" + "فى حالات المعاينة فقط تكون مصروفات المعاينة 25 جنيه فى جميع المناطق\n" + " * نغطى القاهرة الكبرى بالكامل");
                servicesDao.insert(services15);













//

            });
        }
    };

}
